Tekla.Structures.Internal.Plugins


Tekla.Structures.Internal.Plugins.PluginManager
Plugin Manager, there's only one instance

Tekla.Structures.Internal.Plugins.PluginStack
Stack of plugins (in case of nested plugins)

Tekla.Structures.Internal.Plugins.CurrentHelper
Current plugin instance wrapper

Tekla.Structures.Internal.Plugins.LoadedPluginAssemblies
Plugin assemblies loaded to default appdomain in Assembly.LoadFrom() context.
Used only if UseDefaultAppDomain is true.

Tekla.Structures.Internal.Plugins.SetAssemblyResolver


Tekla.Structures.Internal.Plugins.Run(System.String)


Tekla.Structures.Internal.Plugins.StartPlugin(System.String)


Tekla.Structures.Internal.Plugins.RunPlugin(System.String)
DO NOT USE! For internal usage only!
Param:
Returns:

Tekla.Structures.Internal.Plugins.DefinePluginInput(System.String)


Tekla.Structures.Internal.Plugins.dotExportGetPluginName(Tekla.Structures.Internal.dotPluginName_t@)


Tekla.Structures.Internal.Plugins.dotExportGetPluginId


Tekla.Structures.Internal.Plugins.dotExportSetPluginResult(System.Int32)


Tekla.Structures.Internal.Plugins.dotExportExecutePluginResult(System.Int32)


Tekla.Structures.Internal.Plugins.dotExportGetConnectionCode(Tekla.Structures.Internal.dotConnectionCode_t@)


Tekla.Structures.Internal.Plugins.dotExportSetConnectionCode(Tekla.Structures.Internal.dotConnectionCode_t@)
